MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ2064DAG169/mcu.h
#define _ADCCMPCON4_IEBTWN_POSITION              0x00000004
#define _ADCCMPCON4_IEBTWN_MASK                  0x00000010
#define _ADCCMPCON4_IEBTWN_LENGTH                0x00000001

#define _ADCCMPCON4_DCMPED_POSITION              0x00000005
#define _ADCCMPCON4_DCMPED_MASK                  0x00000020
#define _ADCCMPCON4_DCMPED_LENGTH                0x00000001

#define _ADCCMPCON4_DCMPGIEN_POSITION            0x00000006
#define _ADCCMPCON4_DCMPGIEN_MASK                0x00000040
#define _ADCCMPCON4_DCMPGIEN_LENGTH              0x00000001

#define _ADCCMPCON4_ENDCMP_POSITION              0x00000007
#define _ADCCMPCON4_ENDCMP_MASK                  0x00000080
#define _ADCCMPCON4_ENDCMP_LENGTH                0x00000001

#define _ADCCMPCON4_AINID_POSITION               0x00000008
#define _ADCCMPCON4_AINID_MASK                   0x00001F00
#define _ADCCMPCON4_AINID_LENGTH                 0x00000005

#define _ADCCMPCON5_IELOLO_POSITION              0x00000000
#define _ADCCMPCON5_IELOLO_MASK                  0x00000001
#define _ADCCMPCON5_IELOLO_LENGTH                0x00000001

#define _ADCCMPCON5_IELOHI_POSITION              0x00000001
#define _ADCCMPCON5_IELOHI_MASK                  0x00000002
#define _ADCCMPCON5_IELOHI_LENGTH                0x00000001

#define _ADCCMPCON5_IEHILO_POSITION              0x00000002
#define _ADCCMPCON5_IEHILO_MASK                  0x00000004
#define _ADCCMPCON5_IEHILO_LENGTH                0x00000001

#define _ADCCMPCON5_IEHIHI_POSITION              0x00000003
#define _ADCCMPCON5_IEHIHI_MASK                  0x00000008
#define _ADCCMPCON5_IEHIHI_LENGTH                0x00000001

#define _ADCCMPCON5_IEBTWN_POSITION              0x00000004
#define _ADCCMPCON5_IEBTWN_MASK                  0x00000010
#define _ADCCMPCON5_IEBTWN_LENGTH                0x00000001

#define _ADCCMPCON5_DCMPED_POSITION              0x00000005
#define _ADCCMPCON5_DCMPED_MASK                  0x00000020
#define _ADCCMPCON5_DCMPED_LENGTH                0x00000001

#define _ADCCMPCON5_DCMPGIEN_POSITION            0x00000006
#define _ADCCMPCON5_DCMPGIEN_MASK                0x00000040
#define _ADCCMPCON5_DCMPGIEN_LENGTH              0x00000001

#define _ADCCMPCON5_ENDCMP_POSITION              0x00000007
#define _ADCCMPCON5_ENDCMP_MASK                  0x00000080
#define _ADCCMPCON5_ENDCMP_LENGTH                0x00000001

#define _ADCCMPCON5_AINID_POSITION               0x00000008
#define _ADCCMPCON5_AINID_MASK                   0x00001F00
#define _ADCCMPCON5_AINID_LENGTH                 0x00000005

#define _ADCCMPCON6_IELOLO_POSITION              0x00000000
#define _ADCCMPCON6_IELOLO_MASK                  0x00000001
#define _ADCCMPCON6_IELOLO_LENGTH                0x00000001

#define _ADCCMPCON6_IELOHI_POSITION              0x00000001
#define _ADCCMPCON6_IELOHI_MASK                  0x00000002
#define _ADCCMPCON6_IELOHI_LENGTH                0x00000001

#define _ADCCMPCON6_IEHILO_POSITION              0x00000002
#define _ADCCMPCON6_IEHILO_MASK                  0x00000004
#define _ADCCMPCON6_IEHILO_LENGTH                0x00000001

#define _ADCCMPCON6_IEHIHI_POSITION              0x00000003
#define _ADCCMPCON6_IEHIHI_MASK                  0x00000008
#define _ADCCMPCON6_IEHIHI_LENGTH                0x00000001

#define _ADCCMPCON6_IEBTWN_POSITION              0x00000004
#define _ADCCMPCON6_IEBTWN_MASK                  0x00000010
#define _ADCCMPCON6_IEBTWN_LENGTH                0x00000001

#define _ADCCMPCON6_DCMPED_POSITION              0x00000005
#define _ADCCMPCON6_DCMPED_MASK                  0x00000020
#define _ADCCMPCON6_DCMPED_LENGTH                0x00000001

#define _ADCCMPCON6_DCMPGIEN_POSITION            0x00000006
#define _ADCCMPCON6_DCMPGIEN_MASK                0x00000040
#define _ADCCMPCON6_DCMPGIEN_LENGTH              0x00000001

#define _ADCCMPCON6_ENDCMP_POSITION              0x00000007
#define _ADCCMPCON6_ENDCMP_MASK                  0x00000080
#define _ADCCMPCON6_ENDCMP_LENGTH                0x00000001

#define _ADCCMPCON6_AINID_POSITION               0x00000008
#define _ADCCMPCON6_AINID_MASK                   0x00001F00
#define _ADCCMPCON6_AINID_LENGTH                 0x00000005

#define _ADCFSTAT_ADCID_POSITION                 0x00000000
#define _ADCFSTAT_ADCID_MASK                     0x00000007
#define _ADCFSTAT_ADCID_LENGTH                   0x00000003

#define _ADCFSTAT_FSIGN_POSITION                 0x00000007
#define _ADCFSTAT_FSIGN_MASK                     0x00000080
#define _ADCFSTAT_FSIGN_LENGTH                   0x00000001

#define _ADCFSTAT_FCNT_POSITION                  0x00000008
#define _ADCFSTAT_FCNT_MASK                      0x0000FF00
#define _ADCFSTAT_FCNT_LENGTH                    0x00000008

#define _ADCFSTAT_FWROVERR_POSITION              0x00000015
#define _ADCFSTAT_FWROVERR_MASK                  0x00200000
#define _ADCFSTAT_FWROVERR_LENGTH                0x00000001

#define _ADCFSTAT_FRDY_POSITION                  0x00000016
#define _ADCFSTAT_FRDY_MASK                      0x00400000
#define _ADCFSTAT_FRDY_LENGTH                    0x00000001

#define _ADCFSTAT_FIEN_POSITION                  0x00000017
#define _ADCFSTAT_FIEN_MASK                      0x00800000
#define _ADCFSTAT_FIEN_LENGTH                    0x00000001

#define _ADCFSTAT_ADC0EN_POSITION                0x00000018
#define _ADCFSTAT_ADC0EN_MASK                    0x01000000
#define _ADCFSTAT_ADC0EN_LENGTH                  0x00000001

#define _ADCFSTAT_ADC1EN_POSITION                0x00000019
#define _ADCFSTAT_ADC1EN_MASK                    0x02000000
#define _ADCFSTAT_ADC1EN_LENGTH                  0x00000001

#define _ADCFSTAT_ADC2EN_POSITION                0x0000001A
#define _ADCFSTAT_ADC2EN_MASK                    0x04000000
#define _ADCFSTAT_ADC2EN_LENGTH                  0x00000001

#define _ADCFSTAT_ADC3EN_POSITION                0x0000001B
#define _ADCFSTAT_ADC3EN_MASK                    0x08000000
#define _ADCFSTAT_ADC3EN_LENGTH                  0x00000001

#define _ADCFSTAT_ADC4EN_POSITION                0x0000001C
#define _ADCFSTAT_ADC4EN_MASK                    0x10000000
#define _ADCFSTAT_ADC4EN_LENGTH                  0x00000001

#define _ADCFSTAT_FEN_POSITION                   0x0000001F
#define _ADCFSTAT_FEN_MASK                       0x80000000
#define _ADCFSTAT_FEN_LENGTH                     0x00000001

#define _ADCFIFO_DATA_POSITION                   0x00000000
#define _ADCFIFO_DATA_MASK                       0xFFFFFFFF
#define _ADCFIFO_DATA_LENGTH                     0x00000020

#define _ADCBASE_ADCBASE_POSITION                0x00000000
#define _ADCBASE_ADCBASE_MASK                    0x0000FFFF
#define _ADCBASE_ADCBASE_LENGTH                  0x00000010

#define _ADCTRGSNS_LVL0_POSITION                 0x00000000
#define _ADCTRGSNS_LVL0_MASK                     0x00000001
#define _ADCTRGSNS_LVL0_LENGTH                   0x00000001

#define _ADCTRGSNS_LVL1_POSITION                 0x00000001
#define _ADCTRGSNS_LVL1_MASK                     0x00000002
#define _ADCTRGSNS_LVL1_LENGTH                   0x00000001

